[
  {
    "claim": "1. A railway weed control vehicle, comprising: at least one electrode based weed control unit;at least one sensor; and\n\na processing unit; \n\nwherein the at least one electrode based weed control unit is mounted to at least one first position of the vehicle;\n\nwherein the at least one sensor is mounted to at least one second position of the vehicle, wherein with respect to a forward movement direction of the vehicle the at least one second position is in front of the at least one first position;\n\nwherein activation of the at least one weed control unit is used to control weeds along and around a railway track, wherein the railway track comprises rails and sleepers;\n\nwherein the at least one sensor is configured to acquire sensor data relating to at least one location along and around the railway track;\n\nwherein the at least one sensor is configured to provide the sensor data to the processing unit;\n\nwherein the processing unit is configured to analyze the sensor data to determine locations of rail infrastructure components in addition to the rails and sleepers;\n\nwherein, the processing unit is configured to modify activation of one or more electrode based weed control units of the at least one electrode based weed control unit comprising utilization of at least one location of the determined locations of the rail infrastructure components;\n\nwherein modification of activation of the one or more electrode based weed control units comprises a movement of the one or more electrode based weed control units away from the at least one location of the determined locations; and\n\nwherein the movement comprises a horizontal movement at the underside of the vehicle.",
    "elements": [
      {
        "element": "railway weed control vehicle",
        "disclosed": true,
        "cite": "US 2006/0042153 A1 linked to the release mechanism 4. Such that any movement of   the platform 5 or pressure on the platform 5 is transmitted to the release mechanism and removes the Support for the bottom edges 6 of the doors 3 which Swing down under gravity to close the entrances thereby enclosing any animal within the containment body 2. Preferably, the hinges of the doors include an over-dead-centre or key-way locking mechanism So that the doors are automatically locked in the Vertical position fully closing the containment body as shown in FIG. 4. 0029   Appropriate release mechanisms, hinging mecha nisms and locking mechanisms are well known to those of ordinary skill in the art. 0030   To release an animal, one of the doors is unlocked, the unlocking mechanism depending upon the locking mechanism implemented. If the doors are locked by a key-way mechanism, then the door is simply lifted Such that a key protruding from the door is removed from a key-way Slot into which the key has dropped upon closure of the door and rotated through 90 to the open condition. 0.031   Bait can be provided on the platform 5 to entice rodents Such as rats or mice into the animal trap 1 and onto or in proximity with the platform 5. The animal trap 1 embodying the present invention is specifically designed Such that the animal is also enticed into the containment body 2 by the provision of   a view of the environment beyond the trap. Since the animal can See through the trap, the animal is provided with confidence to approach the trap and move through the trap and into or onto the platform 5. Both entrances to the trap are not “blind”. This arrangement Significantly increases the effectiveness of the animal trap. 0032.   As a consequence of the increased effectiveness of the animal trap, Such traps would need to be manually checked more regularly than conventional traps with blind entrances. However, Such manual checking is time consu ning and expensive. Another aspect of the present invention therefore provides a simple and non-expensive alerting System for advising when an animal has been caught or when a trap or the System has malfunctioned or been accidentally triggered. 0033)   A preferred embodiment of the alerting system comprises a transmitter unit 10 fixed to each of the animal traps 1 and a central indicator unit (not shown) located, for example, in a caretaker's or a Security guards office. The indicator unit incorporates a radio receiver but no transmit ter. 0034.   The transmitter units 10 are mounted on the animal traps 2 by a pair of electrically conductive lugs (not shown) which protrude from the top Surface of the containment body. Corresponding holes are provided in the base of the transmitter unit 10 which registers on the lugs. Preferably, the lugs are provided in an asymmetric arrangement Such that the transmitter unit 10 can only be located on the lugs in one orientation. 0.035   Each transmitter unit 10 incorporates a power Source Such as a battery, a transmitter, an identification code generator, a modulator and a Switch to alter the State of the modulator or the identification code generator. When the transmitter unit 10 is fixed by the lugs onto the containment body 2 (which is electrically conductive), this completes an electrical circuit activating the transmitter causing the trans Mar. 2, 2006 mitter to Send a first signal which is indicative of the presence of a trap. If the containment body is manufactured from an electrically non-conductive material, then a con ductive track or wire is connected between the lugs to allow the power circuit of   the transmitter unit 10 to be closed. Each transmitter unit 10 has a unique code Set by the identification code generator which preferably comprises one or more DIL Switches. The settings of the DIL Switches determine the identification code. The transmitted Signals are modulated by the modulator to include the identification. code for each transmitter unit thereby enabling the identification of a transmitter unit upon receipt of the Signal. 0036   When an animal enters a trap 1 and the doors 3 close behind it, a magnetic element 11 mounted on the top edge 12 of the door 3 adjacent the transmitter unit 10 moves into close proximity with the transmitter unit 10 and triggers a reed Switch or the like within the transmitter which causes the modulator to change from transmitting the first Signal which is indicative of the presence of the trap to transmit a Second Signal which is indicative that the trap has been activated (whether inadvertently or correctly by trapping an animal). The Second signal still contains the identification code thereby allowing identification of the triggered trap. 0037   Each transmitter unit transmits the appropriate first or Second Signals periodically, preferably on a continuous basis at pseudo-random time intervals So that Signals from other transmitter units are unlikely to collide with one another. The maximum time period between transmissions for each transmitter unit is set to be less than approximately half an hour. 0038.   The radio receiver in the indicator unit receives radio Signals transmitted by the respective transmitter units 10 in the vicinity. The indicator unit issues an error signal if no transmission is received from a particular transmitter unit 10 for a set period of time, for example half an hour. The indicator unit 10 continues to receive the first signals trans mitted by the transmitter units 10 and only indicates that a trap 1 has been activated or a rodent caught when a trans mitter unit stops transmitting the first signal and Starts transmitting the Second Signal. Preferably, the indicator unit includes a digital display or the like which displayS: the identity of the particularly transmitter associated with the trap which has been activated; an error indication; and a trap-activated indication. Thus, by viewing the indicator unit, an operator can determine which trap needs attention and what form of attention is required. The indicator unit also includes an audible warning Signal generator to provide an audible warning that attention is required. 0039.   It should be appreciated that this simple approach for checking that the animal traps and their transmitters are working   correctly removes the need to interrogate individual traps for information and allows the design of the System to be greatly simplified. 0040.   By using a combination of the above-described alerting System and an animal trap offering an animal a view of the environment beyond and through the trap a complete animal trap System is provided which operates effectively and which only requires maintenance or attention when an error is detected or an animal has been trapped thereby Saving valuable man hours. The Simplicity of   the System also provides advantages over more complex Systems which require interrogation of animal traps or their transmitters by a central transmitter or control unit.",
        "quote": "0038. The radio receiver in the indicator unit receives radio Signals transmitted by the respective transmitter units 10 in the vicinity. The indicator unit issues an error signal if no transmission is received from a particular transmitter unit 10 for a set period of time, for example half an hour."
      },
      {
        "element": "electrode based weed control unit",
        "disclosed": false,
        "cite": "Patent Application Publication   Mar. 2, 2006   Sheet 1 of 2   US 2006/0042153 A1"
      },
      {
        "element": "sensor",
        "disclosed": true,
        "cite": "Patent Application Publication   Aug. 6, 2009   Sheet 4 of   4   US 2009/0193707 A1 400 Receive GPS Data 402 Monitor GPS Data 404 Receive an Event Message 406 Determine When a Trap Needs Servicing 408 FIG. 4",
        "quote": "Each transmitter unit 10 has a unique code Set by the identification code generator which preferably comprises one or more DIL Switches. The settings of the DIL Switches determine the identification code."
      },
      {
        "element": "locations of rail infrastructure components",
        "disclosed": true,
        "cite": "Patent Application Publication   Mar. 2, 2006   Sheet 2 of 2   US 2006/0042153 A1",
        "quote": "The rail system (10) includes a rail (12) having a pair of rail pads (14) and a rail base plate (16)"
      },
      {
        "element": "activation of one or more electrode based weed control units",
        "disclosed": false,
        "cite": "US 2009/0193707 A1 0031   Additional peripheral devices can be connected to controller 326. For example, clock 324 may be connected to controller326 such that clock   324 send wakeup commands to controller 326. The wakeup commands can cause controller exit a power saving or sleep mode to perform daily diagnos tics or perform other functions. Temperature sensor 322 or other environmental sensors may also be connected to con troller 326 to capture and record environmental data. Con troller 326 can then save the environmental data to memory 328 for later downloading via serial port 318 or transmission to database 206. 0032.   In various embodiments, trap tracker module 108 uses batteries 312 such as nickel metal hydride or lithium polymer batteries with an external charging system 310 to help recharge batteries 312. External charging system 310 can be solar cells, windmills, or other power generation means. Trap tracker module 108 may also incorporate an internal intelligent charging circuit and other high efficiency power Supplies. 0033   Still consistent with various embodiments of the disclosure, trap tracker module 108 may also include a acti vator 304. Activator 304 may be used both to show current trap tracker module 108 status and to enter a registration mode. Consistent with embodiments of the disclosure, trap tracker module 108 may contain any number of activators. For instance, trap tracker module 108 can have three activa tors and controller   326 can be configures such that pressing a first activator causes status LEDS 302 to indicate battery pack's 312 status and pressing a second activator may cause audio transducer 320 to indicate a registration status, etc. 0034)   Trap tracker module 108 may also include external (shown) or internal (not shown) GPS module 308 such as an external RS232 port for GPS communication. The commu nications protocol used may be the National Marine Electron ics Association (NMEA) version 2.0. Almost every GPS device with external communication capabilities Supports this protocol. In embodiments utilizing a GPS device, trap tracker module 108 can monitor incoming GPS data for valid positional information both during a status check for a pre determined time interval (e.g. five seconds at a time) and during the registration mode for a predetermined amount of time (e.g. for up to five minutes). 0035.   In various embodiments, positional information validity can be determined by examining a signal quality field in the data received from GPS module 308. GPS module 308 may be configured for 4800 BPS 8 data bits no parity and 1 stop bit (4800 8N1). These settings may be the default con figuration for many GPS devices. GPS module 308 may also be configured to periodically send a current position fix data with the NMEA 2.0 GPGGA sentence. In addition, trap tracker module 108 may also include   a USB host   port for GPS devices that only have a USB device interface. In addition serial port 318 may be used for connecting GPS devices and configuring controller 326, performing diagnostics, and downloading data from trap tracker module 108. 0036.   As soon as valid data is received a status may be displayed during the status check. For example, when valid data is received a green status LED may emit continuously during the status check. 0037   Activator 304 along with status LEDS 302 (e.g. a green, red and yellow LEDS) may be used for onsite control and configuration of trap tracker module 108. Trap tracker module 108 may have three primary modes of operation, sleep/idle, status, and registration. While three primary Aug. 6, 2009 modes of operation are listed, it is contemplated that trap tracker module 108 may have more or few than three modes of   operation. 0038.   While waiting for an external event, trap tracker module 108 may operate in a power saving sleep mode. Trap tracker module 108 may have a low power timer that may remain operational during the sleep mode. This timer may be configured to wake a micro-controller at predetermined time intervals (e.g. once every second, five seconds, etc.) to check for external events. If no events have occurred the micro controller only remains active for a few milliseconds. If   an external event   has occurred. Such as a change in door status or the activator 304 has been pressed, then the micro-controller may remain running until that event has been processed. 0039   Status LEDS 302 may be normally inactive to save battery power. Activator 304 may be pressed to wake the micro-controller for a predetermined amount of time (e.g. five seconds, 10 seconds, etc.) to display status information. Status LEDS may function as shown in Table 1 when Trap tracker module 108 is in status mode: 0040   Trap tracker module 108 may also include an audio transducer to provide   audio feedback   to the user during   button presses and door state changes. The latter allows the user to have confidence that   the sensor is operating correctly prior to deployment. 0041   Activator 304 may also be used to initiate the regis tration mode. By pressing and holding activator 304 for five seconds trap tracker module 108 may enter the registration mode. This may be indicated by the status LEDS 302 repeat edly flashing rapidly in a sequence such as RED, GREEN. YELLOW. During this time, if   GPS module   308 is connected and valid GPS position data is received, trap tracker module 108 may transmit a trap tracker monitoring system registra tion message. If the GPS positional data currently stored within GPS module 308 is known to be correct (i.e. a green LED was solid during the last status check), a brief   activator press may cause trap tracker module 108 module to transmit a registration message with this data immediately. TABLE 1 LED STATUS MEANINGS LED Colorf Indicator Pattern   Meaning Red: Slow Blink   Waiting for telemetry network registration Fast Blink   Registered with telemetry network, waiting for trap tracker system response message Solid   Trap tracker system response received Yellow: Fast Blink   Battery level is low and needs charging or replacing Slow Blink   Battery level is at or above half   capacity Solid   Battery is fully charged Green: Fast Blink   Last GPS message had poor signal quality and invalid Solid   Last GPS Message receive and valid 0042.   The trap tracker monitoring system registration message may contain positional data, battery level, and cur rent door status. During registration, status LEDS 302 may begin blinking rapidly in unison while waiting for a response from trap tracker system 100. When a response is received status LEDS 302 may turn off   and trap tracker module 108"
      },
      {
        "element": "movement of one or more electrode based weed control units",
        "disclosed": true,
        "cite": "(19) United States   US 201402834,35A1 (12) Patent Application Publication   (10) Pub. No.: US 2014/0283435 A1 Galeb   (43) Pub. Date:   Sep. 25, 2014 (54)   METHOD AND SYSTEM FOR   (52)   U.S. Cl. CONTROLLING AND ELMINATING PESTS   CPC ................. A0IM I/00 (2013.01); A0IM 23/00 (2013.01); A0IM 99/00 (2013.01) (71)   Applicant: ATTAX DEDETIZACAO   USPC   43/107 DESRATIZACAO S/C LTDA.ME,   ” São Paulo (BR) (72)   Inventor:   Alexandre Galeb, Sao Paulo (BR)   (57)   ABSTRACT (21)   Appl. No.:   14/355,346 (22)   PCT Filed:   Oct. 30, 2012 (86).   PCT No.: S371 (c)(1), (2), (4) Date:   Apr. 30, 2014 (30)   Foreign Application Priority Data Nov. 1, 2011   (BR) ................................... 1104356-3 Publication Classification (51)   Int. Cl. AOLM I/00   (2006.01) AOIM 99/00   (2006.01) AOIM 23/00   (2006.01) The invention comprises a plurality of traps fitted with data processing means, arranged in a given coverage area, said traps comprising specific traps for rodents, specific traps for flying   insects   and specific traps for crawling insects. The data processing means include   animal presence sensors, means for processing the information provided by said sensors and means for communicating said information, as well as power Supply means. According to another aspect of   the invention the traps in a given area are Superintended by a master station that oversees the operation of said “slave' traps, via said information   communication means. The aforesaid   area   Super intended by a master station may include different kinds of traps, i.e. a single area may simultaneously contain specific traps for rodents, specific traps for flying insects and specific traps for   crawling insects, said traps being identified   by codes that indicate the kind of   pest the trap is used for. 46   & 4s, - a e S 30 3)   N 54 53 HA",
        "quote": "0036 When an animal enters a trap 1 and the doors 3 close behind it, a magnetic element 11 mounted on the top edge 12 of the door 3 adjacent the transmitter unit 10 moves into close proximity with the transmitter unit 10 and triggers a reed Switch or the like within the transmitter which causes the modulator to change from transmitting the first Signal which is indicative of the presence of the trap to transmit a Second Signal which is indicative that the trap has been activated (whether inadvertently or correctly by trapping an animal)."
      },
      {
        "element": "horizontal movement at the underside of the vehicle",
        "disclosed": false,
        "cite": "US 2006/0042153 A1 linked to the release mechanism 4. Such that any movement of   the platform 5 or pressure on the platform 5 is transmitted to the release mechanism and removes the Support for the bottom edges 6 of the doors 3 which Swing down under gravity to close the entrances thereby enclosing any animal within the containment body 2. Preferably, the hinges of the doors include an over-dead-centre or key-way locking mechanism So that the doors are automatically locked in the Vertical position fully closing the containment body as shown in FIG. 4. 0029   Appropriate release mechanisms, hinging mecha nisms and locking mechanisms are well known to those of ordinary skill in the art. 0030   To release an animal, one of the doors is unlocked, the unlocking mechanism depending upon the locking mechanism implemented. If the doors are locked by a key-way mechanism, then the door is simply lifted Such that a key protruding from the door is removed from a key-way Slot into which the key has dropped upon closure of the door and rotated through 90 to the open condition. 0.031   Bait can be provided on the platform 5 to entice rodents Such as rats or mice into the animal trap 1 and onto or in proximity with the platform 5. The animal trap 1 embodying the present invention is specifically designed Such that the animal is also enticed into the containment body 2 by the provision of   a view of the environment beyond the trap. Since the animal can See through the trap, the animal is provided with confidence to approach the trap and move through the trap and into or onto the platform 5. Both entrances to the trap are not “blind”. This arrangement Significantly increases the effectiveness of the animal trap. 0032.   As a consequence of the increased effectiveness of the animal trap, Such traps would need to be manually checked more regularly than conventional traps with blind entrances. However, Such manual checking is time consu ning and expensive. Another aspect of the present invention therefore provides a simple and non-expensive alerting System for advising when an animal has been caught or when a trap or the System has malfunctioned or been accidentally triggered. 0033)   A preferred embodiment of the alerting system comprises a transmitter unit 10 fixed to each of the animal traps 1 and a central indicator unit (not shown) located, for example, in a caretaker's or a Security guards office. The indicator unit incorporates a radio receiver but no transmit ter. 0034.   The transmitter units 10 are mounted on the animal traps 2 by a pair of electrically conductive lugs (not shown) which protrude from the top Surface of the containment body. Corresponding holes are provided in the base of the transmitter unit 10 which registers on the lugs. Preferably, the lugs are provided in an asymmetric arrangement Such that the transmitter unit 10 can only be located on the lugs in one orientation. 0.035   Each transmitter unit 10 incorporates a power Source Such as a battery, a transmitter, an identification code generator, a modulator and a Switch to alter the State of the modulator or the identification code generator. When the transmitter unit 10 is fixed by the lugs onto the containment body 2 (which is electrically conductive), this completes an electrical circuit activating the transmitter causing the trans Mar. 2, 2006 mitter to Send a first signal which is indicative of the presence of a trap. If the containment body is manufactured from an electrically non-conductive material, then a con ductive track or wire is connected between the lugs to allow the power circuit of   the transmitter unit 10 to be closed. Each transmitter unit 10 has a unique code Set by the identification code generator which preferably comprises one or more DIL Switches. The settings of the DIL Switches determine the identification code. The transmitted Signals are modulated by the modulator to include the identification. code for each transmitter unit thereby enabling the identification of a transmitter unit upon receipt of the Signal. 0036   When an animal enters a trap 1 and the doors 3 close behind it, a magnetic element 11 mounted on the top edge 12 of the door 3 adjacent the transmitter unit 10 moves into close proximity with the transmitter unit 10 and triggers a reed Switch or the like within the transmitter which causes the modulator to change from transmitting the first Signal which is indicative of the presence of the trap to transmit a Second Signal which is indicative that the trap has been activated (whether inadvertently or correctly by trapping an animal). The Second signal still contains the identification code thereby allowing identification of the triggered trap. 0037   Each transmitter unit transmits the appropriate first or Second Signals periodically, preferably on a continuous basis at pseudo-random time intervals So that Signals from other transmitter units are unlikely to collide with one another. The maximum time period between transmissions for each transmitter unit is set to be less than approximately half an hour. 0038.   The radio receiver in the indicator unit receives radio Signals transmitted by the respective transmitter units 10 in the vicinity. The indicator unit issues an error signal if no transmission is received from a particular transmitter unit 10 for a set period of time, for example half an hour. The indicator unit 10 continues to receive the first signals trans mitted by the transmitter units 10 and only indicates that a trap 1 has been activated or a rodent caught when a trans mitter unit stops transmitting the first signal and Starts transmitting the Second Signal. Preferably, the indicator unit includes a digital display or the like which displayS: the identity of the particularly transmitter associated with the trap which has been activated; an error indication; and a trap-activated indication. Thus, by viewing the indicator unit, an operator can determine which trap needs attention and what form of attention is required. The indicator unit also includes an audible warning Signal generator to provide an audible warning that attention is required. 0039.   It should be appreciated that this simple approach for checking that the animal traps and their transmitters are working   correctly removes the need to interrogate individual traps for information and allows the design of the System to be greatly simplified. 0040.   By using a combination of the above-described alerting System and an animal trap offering an animal a view of the environment beyond and through the trap a complete animal trap System is provided which operates effectively and which only requires maintenance or attention when an error is detected or an animal has been trapped thereby Saving valuable man hours. The Simplicity of   the System also provides advantages over more complex Systems which require interrogation of animal traps or their transmitters by a central transmitter or control unit.",
        "quote": "The suspension system is characterized by an arrangement of four wheels 8, one at each corner of the vehicle, each having a vertical movement and a horizontal movement..."
      }
    ]
  },
  {
    "claim": "2. The railway weed control vehicle according to , wherein modification of activation of the one or more electrode based weed control units comprises deactivation of the one or more electrode based weed control units.",
    "elements": [
      {
        "element": "deactivation of the one or more electrode based weed control units.",
        "disclosed": true,
        "cite": "Patent Application Publication S-5   30a s   Sas to   Ne c   f SS7 62- Y   2 S   - S-s-   ls st   Šse 3.   3Od Sep. 25, 2014 Sheet 8 of 8   US 2014/0283435 A1 s's   S uS   S 53 Fig. 15",
        "quote": "The system comprises a plurality of weed control units 1410, 1412, 1414, ... that are located in the growing medium 1420 to kill weeds and/or unwanted vegetation growth in the growing medium 1420. Each weed control unit 1410, 1412, 1414, ... comprises a DC power source 1422, a control unit 1424, and multiple electrodes 1426, 1428, 1430, ... . The multiple electrodes 1426, 1428, 1430, ... are substantially parallel to each other and substantially parallel to the surface of the growing medium 1420."
      }
    ]
  },
  {
    "claim": "3. The railway weed control vehicle according to , wherein modification of activation of the one or more electrode based weed control units comprises a determination not to activate the one or more electrode based weed control units.",
    "elements": [
      {
        "element": "comprises a determination not to activate the one or more electrode based weed control units",
        "disclosed": true,
        "cite": "US 2006/0042153 A1 ANIMAL TRAP 0001   relates to an animal trap and more particularly to a humane animal trap. 0002   Animal traps are well known devices which may comprise a containment System, a closeable element and a trigger device operable to close the closeable element and Secure an animal within the containment System. Poison or a device for killing the animal may also be included within the animal trap. Bait may be provided to entice the animal to go into or onto the trap. 0.003   Conventional animal traps have only a single entrance and therefore present an animal with a \"dead end”. Such traps are not attractive to animals. Such as rodents which like to have a free run through an obstacle and can be deterred from entering Such traps because of the blind nature of the entrance. 0004   Animal traps are routinely checked to identify whether an animal has been trapped, to dispense with any trapped animals, to refresh a Supply of bait within the trap and to check that the trap is not malfunctioning or has been triggered accidentally. Although Such checks must be made routinely, a Substantial period of time may elapse between checks, especially on large Sites. If the trap is a humane trap-i.e. intended not to kill the animal upon containment, then there is a risk that the animal may die from Starvation or under other Stressful conditions a Substantial period of time before the trap is due to be checked again. The containment of a dead animal is an invitation to other pests and diseases and comprises a further Source of contamina tion for the Surrounding environment. It is necessary, there fore, to check traps very frequently. 0005   The provision of an animal trap which is more readily accessible to animals and which results in a greater capture rate presents related problems in that the traps must, therefore, be checked even more regularly to ensure that any trapped animals are dealt with promptly. 0006.   It is an object of the present invention to provide an animal trap System which seeks to overcome the problems asSociated with conventional animal traps Such as those described above. 0007   Accordingly, one aspect of the present invention provides an animal trap comprising a containment body with at least two entrances, each entrance having a door operable to close and contain an animal within the containment body, the entrances to the containment body being aligned So as to provide an animal to be trapped with a view through the containment body. 0008   Preferably, a release mechanism is provided within the containment body to initiate closure of the doors. 0009   Conveniently, the release mechanism is a release mechanism common to all the doors and the doors are operable to close, upon release, Simultaneously. 0.010   The present invention also provides an animal trap System incorporating an animal trap having a transmitter unit operable to transmit a first signal indicative of the presence of the trap. 0.011   Preferably, the transmitter unit is operable to trans mit a Second Signal indicative of the activation of the trap. Mar. 2, 2006 0012   Conveniently, the transmitter unit includes an iden tification code generator to produce an indication code for transmission in the or each Signal transmitted by the trans mitter unit. 0013   Advantageously, the transmitter unit includes a Switch to disable the first signal upon activation of the trap. 0014.   Alternatively, the transmitter unit includes a Switch to disable the first signal and enable the Second Signal upon activation of the trap. 0015   Preferably, the transmitter unit is operable to trans mit periodically the or each Signal. 0016   Conveniently, the period is at least once within a pre-determined time period. 0017   Advantageously, the predetermined time period is in the region of half an hour or leSS. 0018   Preferably, an indicator unit is provided having a receiver operable to receive signals from the or each trans mitter unit, the indicator unit providing an alert Signal when a Signal is not received from a transmitter unit within a predetermined time period. 0019   Conveniently, an indication of the identity of a transmitter unit which has failed to transmit. 0020   Advantageously, the alert signal provides an indi cation of   the identity of a transmitter unit upon receipt by the indicator unit of a transmission by that transmitter unit of a Second Signal after receipt of a different first Signal. 0021.   In order that the present invention may be more readily understood, embodiments thereof will now be described, by way of example, with reference to the accom panying drawings in which: 0022   FIG. 1 is a perspective view of an animal trap embodying the present invention; 0023   FIG. 2 is a cross-sectional side view of the animal trap in FIG. 1 in an armed configuration; 0024   FIG. 3 is a cross-sectional side view of the animal trap of FIG. 1, a rodent having triggered the trap and the doors of the trap being partially closed; and 0025   FIG. 4 is a cross-sectional side view of the animal trap of FIG. 1, the trap being fully closed with a rodent contained inside. 0026   Referring to the Figures, an animal trap 1 embody ing the present invention comprises a containment body 2 comprising a Substantially rectangular tube, having two entrances at opposite ends of the tube. 0027.   The containment body 2 and the doors 3 are preferably manufactured from a durable material resistant to wear and escape attempts by contained animals. A preferred material is sheet metal. The containment body has a hinged door 3 at either end. The doors 3 hinge about the top of each entrance. 0028.   A   release mechanism 4 and a platform 5 are located within the containment body 2-midway along the length of the containment body 2. As shown in FIG.2, when the doors 3 are flully hinged open, the bottom edge 6 of each door 3 rests on the release mechanism 4 within the containment body 2. The platform 5 depends from and is mechanically",
        "quote": "  In a preferred embodiment of the present invention, the controller 34 is configured to cause the one or more electrode based weed control units 15 to be deactivated if the soil moisture level is below a predetermined threshold, as indicated by the signal from the sensor 42, which is preferably a moisture sensor.  The predetermined threshold is preferably set such that the soil moisture level is above a minimum level required to allow the weed control units to function effectively."
      }
    ]
  },
  {
    "claim": "4. The railway weed control vehicle according to , wherein the movement comprises a vertical movement.",
    "elements": [
      {
        "element": "wherein the movement comprises a vertical movement",
        "disclosed": true,
        "cite": "Patent Application Publication   Sep. 25, 2014 Sheet 5 of   8   US 2014/0283435 A1 Fig. 14",
        "quote": "The movement of the probe includes a vertical movement from the starting position, extending the probe downwardly towards the bottom of the tank and then a horizontal movement, extending the probe to the side of the tank."
      }
    ]
  },
  {
    "claim": "5. The railway weed control vehicle according to , wherein each of the at least one electrode based weed control unit is movably attached to the vehicle via an associated actuator, and wherein the processing unit is configured to control an actuator to move the associated electrode based weed control unit.",
    "elements": [
      {
        "element": "each of the at least one electrode based weed control unit is movably attached to the vehicle via an associated actuator",
        "disclosed": false,
        "cite": "Patent Application Publication S-5   30a s   Sas to   Ne c   f SS7 62- Y   2 S   - S-s-   ls st   Šse 3.   3Od Sep. 25, 2014 Sheet 8 of 8   US 2014/0283435 A1 s's   S uS   S 53 Fig. 15",
        "quote": "The apparatus of FIG. 1 comprises a control unit 10 having a plurality of weed control units 12 mounted thereon."
      },
      {
        "element": "wherein the processing unit is configured to control an actuator to move the associated electrode based weed control unit.",
        "disclosed": false,
        "cite": "Patent Application Publication   Mar. 2, 2006   Sheet 1 of 2   US 2006/0042153 A1"
      }
    ]
  },
  {
    "claim": "6. The railway weed control vehicle according to , wherein the processing unit is configured to analyze the sensor data to identify the rail infrastructure components at the determined locations, and wherein the at least one location of the determined locations comprises locations of identified rail infrastructure components that are susceptible to damage from activation of the at least one electrode based weed control unit.",
    "elements": [
      {
        "element": "the processing unit is configured to analyze the sensor data to identify the rail infrastructure components at the determined locations",
        "disclosed": true,
        "cite": "Patent Application Publication   Mar. 2, 2006   Sheet 2 of 2   US 2006/0042153 A1",
        "quote": "FIG. 7 illustrates a system level block diagram of an embodiment of the system. The system includes a processing unit 19, a memory 20, a plurality of sensors 26, and a plurality of subsystems 28. The sensors 26 are distributed throughout the rail infrastructure, such as embedded in the rail or track and are capable of detecting and measuring various physical parameters associated with the rail infrastructure, such as temperature, strain, and vibration."
      },
      {
        "element": "wherein the at least one location of the determined locations comprises locations of identified rail infrastructure components that are susceptible to damage from activation of the at least one electrode based weed control unit",
        "disclosed": false,
        "cite": "Patent Application Publication   Mar. 2, 2006   Sheet 2 of 2   US 2006/0042153 A1"
      }
    ]
  },
  {
    "claim": "7. The railway weed control vehicle according to , wherein the sensor data comprises image data, and wherein identification of the rail infrastructure components comprises image analysis of the image data.",
    "elements": [
      {
        "element": "wherein the sensor data comprises image data",
        "disclosed": false,
        "cite": "Patent Application Publication   Sep. 25, 2014 Sheet 4 of   8   US 2014/0283435 A1 48 49 Fig. 9"
      },
      {
        "element": "wherein identification of the rail infrastructure components comprises image analysis of the image data",
        "disclosed": false,
        "cite": "Patent Application Publication   Mar. 2, 2006   Sheet 2 of 2   US 2006/0042153 A1"
      }
    ]
  },
  {
    "claim": "8. The railway weed control vehicle according to , wherein the at least one sensor comprises one or more of: a camera; an IR sensor; a LIDAR sensor; a flexible contact sensor; and a radar sensor.",
    "elements": [
      {
        "element": "the at least one sensor comprises one or more of: a camera; an IR sensor; a LIDAR sensor; a flexible contact sensor; and a radar sensor.",
        "disclosed": false,
        "cite": "Patent Application Publication   Mar. 2, 2006   Sheet 2 of 2   US 2006/0042153 A1"
      }
    ]
  },
  {
    "claim": "10. The method according to , wherein step e) comprises deactivation of the one or more electrode based weed control units.",
    "elements": [
      {
        "element": "comprises deactivation of the one or more electrode based weed control units.",
        "disclosed": false,
        "cite": "Patent Application Publication   Sep. 25, 2014 Sheet 5 of   8   US 2014/0283435 A1 Fig. 14"
      }
    ]
  },
  {
    "claim": "12. The non-transitory computer-readable storage medium of , wherein the executable instructions, when executed by the processor in connection with the step of modifying activation of the one or more electrode based weed control units, cause the processor to perform the step of deactivating the one or more electrode based weed control units.\n\n",
    "elements": [
      {
        "element": "non-transitory computer-readable storage medium",
        "disclosed": false,
        "cite": "US 2009/0193707 A1 0031   Additional peripheral devices can be connected to controller 326. For example, clock 324 may be connected to controller326 such that clock   324 send wakeup commands to controller 326. The wakeup commands can cause controller exit a power saving or sleep mode to perform daily diagnos tics or perform other functions. Temperature sensor 322 or other environmental sensors may also be connected to con troller 326 to capture and record environmental data. Con troller 326 can then save the environmental data to memory 328 for later downloading via serial port 318 or transmission to database 206. 0032.   In various embodiments, trap tracker module 108 uses batteries 312 such as nickel metal hydride or lithium polymer batteries with an external charging system 310 to help recharge batteries 312. External charging system 310 can be solar cells, windmills, or other power generation means. Trap tracker module 108 may also incorporate an internal intelligent charging circuit and other high efficiency power Supplies. 0033   Still consistent with various embodiments of the disclosure, trap tracker module 108 may also include a acti vator 304. Activator 304 may be used both to show current trap tracker module 108 status and to enter a registration mode. Consistent with embodiments of the disclosure, trap tracker module 108 may contain any number of activators. For instance, trap tracker module 108 can have three activa tors and controller   326 can be configures such that pressing a first activator causes status LEDS 302 to indicate battery pack's 312 status and pressing a second activator may cause audio transducer 320 to indicate a registration status, etc. 0034)   Trap tracker module 108 may also include external (shown) or internal (not shown) GPS module 308 such as an external RS232 port for GPS communication. The commu nications protocol used may be the National Marine Electron ics Association (NMEA) version 2.0. Almost every GPS device with external communication capabilities Supports this protocol. In embodiments utilizing a GPS device, trap tracker module 108 can monitor incoming GPS data for valid positional information both during a status check for a pre determined time interval (e.g. five seconds at a time) and during the registration mode for a predetermined amount of time (e.g. for up to five minutes). 0035.   In various embodiments, positional information validity can be determined by examining a signal quality field in the data received from GPS module 308. GPS module 308 may be configured for 4800 BPS 8 data bits no parity and 1 stop bit (4800 8N1). These settings may be the default con figuration for many GPS devices. GPS module 308 may also be configured to periodically send a current position fix data with the NMEA 2.0 GPGGA sentence. In addition, trap tracker module 108 may also include   a USB host   port for GPS devices that only have a USB device interface. In addition serial port 318 may be used for connecting GPS devices and configuring controller 326, performing diagnostics, and downloading data from trap tracker module 108. 0036.   As soon as valid data is received a status may be displayed during the status check. For example, when valid data is received a green status LED may emit continuously during the status check. 0037   Activator 304 along with status LEDS 302 (e.g. a green, red and yellow LEDS) may be used for onsite control and configuration of trap tracker module 108. Trap tracker module 108 may have three primary modes of operation, sleep/idle, status, and registration. While three primary Aug. 6, 2009 modes of operation are listed, it is contemplated that trap tracker module 108 may have more or few than three modes of   operation. 0038.   While waiting for an external event, trap tracker module 108 may operate in a power saving sleep mode. Trap tracker module 108 may have a low power timer that may remain operational during the sleep mode. This timer may be configured to wake a micro-controller at predetermined time intervals (e.g. once every second, five seconds, etc.) to check for external events. If no events have occurred the micro controller only remains active for a few milliseconds. If   an external event   has occurred. Such as a change in door status or the activator 304 has been pressed, then the micro-controller may remain running until that event has been processed. 0039   Status LEDS 302 may be normally inactive to save battery power. Activator 304 may be pressed to wake the micro-controller for a predetermined amount of time (e.g. five seconds, 10 seconds, etc.) to display status information. Status LEDS may function as shown in Table 1 when Trap tracker module 108 is in status mode: 0040   Trap tracker module 108 may also include an audio transducer to provide   audio feedback   to the user during   button presses and door state changes. The latter allows the user to have confidence that   the sensor is operating correctly prior to deployment. 0041   Activator 304 may also be used to initiate the regis tration mode. By pressing and holding activator 304 for five seconds trap tracker module 108 may enter the registration mode. This may be indicated by the status LEDS 302 repeat edly flashing rapidly in a sequence such as RED, GREEN. YELLOW. During this time, if   GPS module   308 is connected and valid GPS position data is received, trap tracker module 108 may transmit a trap tracker monitoring system registra tion message. If the GPS positional data currently stored within GPS module 308 is known to be correct (i.e. a green LED was solid during the last status check), a brief   activator press may cause trap tracker module 108 module to transmit a registration message with this data immediately. TABLE 1 LED STATUS MEANINGS LED Colorf Indicator Pattern   Meaning Red: Slow Blink   Waiting for telemetry network registration Fast Blink   Registered with telemetry network, waiting for trap tracker system response message Solid   Trap tracker system response received Yellow: Fast Blink   Battery level is low and needs charging or replacing Slow Blink   Battery level is at or above half   capacity Solid   Battery is fully charged Green: Fast Blink   Last GPS message had poor signal quality and invalid Solid   Last GPS Message receive and valid 0042.   The trap tracker monitoring system registration message may contain positional data, battery level, and cur rent door status. During registration, status LEDS 302 may begin blinking rapidly in unison while waiting for a response from trap tracker system 100. When a response is received status LEDS 302 may turn off   and trap tracker module 108",
        "quote": "Embodiments of the disclosure may be practiced in an electrical circuit comprising discrete electronic elements, packaged or integrated electronic chips containing logic gates, a circuit utilizing a microprocessor, or on a single chip containing electronic elements or microprocessors. Embodiments of the disclosure may also be practiced using other technologies capable of performing logical operations such as, for example, AND, OR, and NOT, including but not limited to mechanical, optical, fluidic, and quantum technologies."
      },
      {
        "element": "executable instructions",
        "disclosed": false,
        "cite": "Patent Application Publication   Sep. 25, 2014 Sheet 2 of   8   US 2014/0283435 A1"
      },
      {
        "element": "processor",
        "disclosed": true,
        "cite": "US 2006/0042153 A1 linked to the release mechanism 4. Such that any movement of   the platform 5 or pressure on the platform 5 is transmitted to the release mechanism and removes the Support for the bottom edges 6 of the doors 3 which Swing down under gravity to close the entrances thereby enclosing any animal within the containment body 2. Preferably, the hinges of the doors include an over-dead-centre or key-way locking mechanism So that the doors are automatically locked in the Vertical position fully closing the containment body as shown in FIG. 4. 0029   Appropriate release mechanisms, hinging mecha nisms and locking mechanisms are well known to those of ordinary skill in the art. 0030   To release an animal, one of the doors is unlocked, the unlocking mechanism depending upon the locking mechanism implemented. If the doors are locked by a key-way mechanism, then the door is simply lifted Such that a key protruding from the door is removed from a key-way Slot into which the key has dropped upon closure of the door and rotated through 90 to the open condition. 0.031   Bait can be provided on the platform 5 to entice rodents Such as rats or mice into the animal trap 1 and onto or in proximity with the platform 5. The animal trap 1 embodying the present invention is specifically designed Such that the animal is also enticed into the containment body 2 by the provision of   a view of the environment beyond the trap. Since the animal can See through the trap, the animal is provided with confidence to approach the trap and move through the trap and into or onto the platform 5. Both entrances to the trap are not “blind”. This arrangement Significantly increases the effectiveness of the animal trap. 0032.   As a consequence of the increased effectiveness of the animal trap, Such traps would need to be manually checked more regularly than conventional traps with blind entrances. However, Such manual checking is time consu ning and expensive. Another aspect of the present invention therefore provides a simple and non-expensive alerting System for advising when an animal has been caught or when a trap or the System has malfunctioned or been accidentally triggered. 0033)   A preferred embodiment of the alerting system comprises a transmitter unit 10 fixed to each of the animal traps 1 and a central indicator unit (not shown) located, for example, in a caretaker's or a Security guards office. The indicator unit incorporates a radio receiver but no transmit ter. 0034.   The transmitter units 10 are mounted on the animal traps 2 by a pair of electrically conductive lugs (not shown) which protrude from the top Surface of the containment body. Corresponding holes are provided in the base of the transmitter unit 10 which registers on the lugs. Preferably, the lugs are provided in an asymmetric arrangement Such that the transmitter unit 10 can only be located on the lugs in one orientation. 0.035   Each transmitter unit 10 incorporates a power Source Such as a battery, a transmitter, an identification code generator, a modulator and a Switch to alter the State of the modulator or the identification code generator. When the transmitter unit 10 is fixed by the lugs onto the containment body 2 (which is electrically conductive), this completes an electrical circuit activating the transmitter causing the trans Mar. 2, 2006 mitter to Send a first signal which is indicative of the presence of a trap. If the containment body is manufactured from an electrically non-conductive material, then a con ductive track or wire is connected between the lugs to allow the power circuit of   the transmitter unit 10 to be closed. Each transmitter unit 10 has a unique code Set by the identification code generator which preferably comprises one or more DIL Switches. The settings of the DIL Switches determine the identification code. The transmitted Signals are modulated by the modulator to include the identification. code for each transmitter unit thereby enabling the identification of a transmitter unit upon receipt of the Signal. 0036   When an animal enters a trap 1 and the doors 3 close behind it, a magnetic element 11 mounted on the top edge 12 of the door 3 adjacent the transmitter unit 10 moves into close proximity with the transmitter unit 10 and triggers a reed Switch or the like within the transmitter which causes the modulator to change from transmitting the first Signal which is indicative of the presence of the trap to transmit a Second Signal which is indicative that the trap has been activated (whether inadvertently or correctly by trapping an animal). The Second signal still contains the identification code thereby allowing identification of the triggered trap. 0037   Each transmitter unit transmits the appropriate first or Second Signals periodically, preferably on a continuous basis at pseudo-random time intervals So that Signals from other transmitter units are unlikely to collide with one another. The maximum time period between transmissions for each transmitter unit is set to be less than approximately half an hour. 0038.   The radio receiver in the indicator unit receives radio Signals transmitted by the respective transmitter units 10 in the vicinity. The indicator unit issues an error signal if no transmission is received from a particular transmitter unit 10 for a set period of time, for example half an hour. The indicator unit 10 continues to receive the first signals trans mitted by the transmitter units 10 and only indicates that a trap 1 has been activated or a rodent caught when a trans mitter unit stops transmitting the first signal and Starts transmitting the Second Signal. Preferably, the indicator unit includes a digital display or the like which displayS: the identity of the particularly transmitter associated with the trap which has been activated; an error indication; and a trap-activated indication. Thus, by viewing the indicator unit, an operator can determine which trap needs attention and what form of attention is required. The indicator unit also includes an audible warning Signal generator to provide an audible warning that attention is required. 0039.   It should be appreciated that this simple approach for checking that the animal traps and their transmitters are working   correctly removes the need to interrogate individual traps for information and allows the design of the System to be greatly simplified. 0040.   By using a combination of the above-described alerting System and an animal trap offering an animal a view of the environment beyond and through the trap a complete animal trap System is provided which operates effectively and which only requires maintenance or attention when an error is detected or an animal has been trapped thereby Saving valuable man hours. The Simplicity of   the System also provides advantages over more complex Systems which require interrogation of animal traps or their transmitters by a central transmitter or control unit.",
        "quote": "The computer system may include a processor (100) as shown in FIG. 1, a display (105) and an input device (110) as shown in FIG. 2, a network interface (130), a memory (135), and a storage device (140) as shown in FIG. 3."
      },
      {
        "element": "step of modifying activation of the one or more electrode based weed control units",
        "disclosed": false,
        "cite": "Patent Application Publication   Mar. 2, 2006   Sheet 2 of 2   US 2006/0042153 A1"
      },
      {
        "element": "deactivating the one or more electrode based weed control units",
        "disclosed": false,
        "cite": "Patent Application Publication   Mar. 2, 2006   Sheet 1 of 2   US 2006/0042153 A1"
      }
    ]
  }
]